array = 1; % array selects 1 of the 5 arays of ex.2

switch array
    case 1
        A1=[3 2; 4 1];
        A2=[3 4; 2 1];
    case 2
        A1=[4 1; 3 2];
        A2=[4 3; 1 2];
    case 3
        A1=[4 3; 3 2];
        A2=[4 3; 1 2];
    case 4
        A1=[1 2 -2; 3 -1 0];
        A2=[-1 3 1; 1 1 0];
    case 5
        A1=[1 2 -2; 3 -1 0; 2 1 4];
        A2=[-1 3 1; 1 1 0; 4 -1 -4];
    case 6
        A1=[1 0 0; 0 1 0; 0 0 1];
        A2=[0 0 1; 1 0 0; 0 1 0]; 
    case 7
        A1=[-3 2 0 1; 2 2 -3 1; 2 -5 -1 1; -4 2 1 -3];
        A2=[-4 -1 6 1; 0 2 0 -2; -3 1 -1 -3; 3 -5 2 1]; 
end

% P0 ειναι ο παικτης ο οποιος παιζει πρωτος, m0 
% ειναι η πρωτη κινηση και Iter ειναι ο αριθμος επαναληψεων
[p1,V1,p2,V2] = FictPlayB(A1,A2,2,1,11);
P = [p1, p2]
V = [V1, V2]
